poiseuille/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

xmin 0;
xmax 10;
ymin -0.5;
ymax 0.5;
zmin 0;
zmax 0.1;

vertices
(
    ($xmin $ymin $zmin) //vertex 0
    ($xmax $ymin $zmin) //vertex 1
    ($xmax $ymax $zmin) //vertex 2
    ($xmin $ymax $zmin) //vertex 3
    ($xmin $ymin $zmax) //vertex 4
    ($xmax $ymin $zmax) //vertex 5
    ($xmax $ymax $zmax) //vertex 6
    ($xmin $ymax $zmax) //vertex 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 50 1) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (250 30 1) simpleGrading (1 1 1)
);

boundary
(
    left 
    {
       type patch;
        faces
        (
            (0 4 7 3)
         );

    }

    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );

    }
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 3 2 1)

        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)

        );
    }
);


// ************************************************************************* //
