poiseuille/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    U
    {
        solver           PBiCG;//stab;
        preconditioner   DILU;
        tolerance        1e-14;
        relTol           1e-06;
    }

    UFinal
    {
        $U;
    }

    p
    {
        solver           PCG;
        preconditioner   FDIC;
        tolerance        1e-14;
        relTol           1e-06;
    }

    pFinal
    {
        $p;
    }

    nut
    {
        solver           PBiCG;//Stab;
        preconditioner   DILU;
        tolerance        1e-14;
        relTol           1e-06;
    }

    nutFinal
    {
        $nut;
    }

    k
    {
        solver           PBiCG;//Stab;
        preconditioner   DILU;
        tolerance        1e-14;
        relTol           1e-06;
    }

    kFinal
    {
        $k;
    }

    omega
    {
        solver           PBiCG;//Stab;
        preconditioner   DILU;
        tolerance        1e-14;
        relTol           1e-06;
    }

    omegaFinal
    {
        $omega;
    }

}

"(SIMPLE|PISO|PIMPLE|FS-PP)"
{
    consistent                 yes;
    nCorrectors                2;
    nOuterCorrectors           1;
    nNonOrthogonalCorrectors   0;
    pRefCell                   0;
    pRefValue                  0;

    relaxationFactors
    {
        fields
        {
            ".*"     		1.0;
        }

        equations
        {
            ".*"		    1.0;
        }
    }
}



// ************************************************************************* //
